{"modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 104, 104, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "encoder_0", "class_name": "Conv2D", "config": {"name": "encoder_0", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "pool_0", "class_name": "MaxPooling2D", "config": {"name": "pool_0", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["encoder_0", 0, 0, {}]]]}, {"name": "encoder_1", "class_name": "Conv2D", "config": {"name": "encoder_1", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_0", 0, 0, {}]]]}, {"name": "pool_1", "class_name": "MaxPooling2D", "config": {"name": "pool_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["encoder_1", 0, 0, {}]]]}, {"name": "encoder_2", "class_name": "Conv2D", "config": {"name": "encoder_2", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_1", 0, 0, {}]]]}, {"name": "pool_2", "class_name": "MaxPooling2D", "config": {"name": "pool_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["encoder_2", 0, 0, {}]]]}, {"name": "encoder_3", "class_name": "Conv2D", "config": {"name": "encoder_3", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool_2", 0, 0, {}]]]}, {"name": "decoder_0", "class_name": "Conv2D", "config": {"name": "decoder_0", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_3", 0, 0, {}]]]}, {"name": "upsample_0", "class_name": "UpSampling2D", "config": {"name": "upsample_0", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["decoder_0", 0, 0, {}]]]}, {"name": "decoder_1", "class_name": "Conv2D", "config": {"name": "decoder_1", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["upsample_0", 0, 0, {}]]]}, {"name": "upsample_1", "class_name": "UpSampling2D", "config": {"name": "upsample_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["decoder_1", 0, 0, {}]]]}, {"name": "decoder_2", "class_name": "Conv2D", "config": {"name": "decoder_2", "trainable": true, "filters": 100, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["upsample_1", 0, 0, {}]]]}, {"name": "upsample_2", "class_name": "UpSampling2D", "config": {"name": "upsample_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["decoder_2", 0, 0, {}]]]}, {"name": "decoder_3", "class_name": "Conv2D", "config": {"name": "decoder_3", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["upsample_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["decoder_3", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"lr": 1.0, "rho": 0.95, "decay": 0.0, "epsilon": 1e-07}}, "loss": "binary_crossentropy", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "decoder_0/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "decoder_0/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "decoder_1/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "decoder_1/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "decoder_2/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "decoder_2/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "decoder_3/kernel", "shape": [3, 3, 100, 3], "dtype": "float32"}, {"name": "decoder_3/bias", "shape": [3], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "encoder_0/kernel", "shape": [3, 3, 3, 100], "dtype": "float32"}, {"name": "encoder_0/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "encoder_1/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "encoder_1/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "encoder_2/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "encoder_2/bias", "shape": [100], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "encoder_3/kernel", "shape": [3, 3, 100, 100], "dtype": "float32"}, {"name": "encoder_3/bias", "shape": [100], "dtype": "float32"}]}]}